RhinoInside.Revit API Documentation
ColorConverter.ToColor Method (Color)
 Converts the specified Color to an equivalent Color.
 Namespace: RhinoInside.Revit.Convert.Eto.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static Color ToColor(
	this Autodesk.Revit.DB.Color value
)
Parameters
value
Type: Autodesk.Revit.DB.Color
A value to convert.
Return Value
Type: Color
An Color that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Color. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ColorConverter Class
ToColor Overload
RhinoInside.Revit.Convert.Eto.Drawing Namespace